greet = """Postg - это простой и удобный бот для отложенного постинга, поддерживающий работу с ⭐️ анимированными эмодзи.

Бот позволяет:

🕔 Планировать выход публикаций в ваших каналах

🗑 Автоматически удалять их по расписанию

👩‍🎨 Создавать и настраивать посты любого формата

👀 И многое другое

Новости сервиса - @PostgNews"""

no_channels = """У вас пока нет подключенных каналов.

Чтобы подключить первый канал, сделайте @postg его администратором, дав следующие права:

✅ Отправка сообщений
✅ Удаление сообщений
✅ Редактирование сообщений

А затем перешлите любое сообщение из канала в диалог с ботом либо отправьте публичную ссылку на ваш канал."""

channel_added = """✅ Вы успешно подключили канал """

not_admin = "🚫 Вы не добавили @postg в администраторы канала!"

not_channel = "🚫 Вы отправили неверную ссылку!"

new_post_onech = """Отправьте боту то, что хотите опубликовать в канале """

menu = "📍 Главное меню"
balance = "💰 Ваш баланс: "
low_balance = "😢 У вас закончились попытки!"
gen_image = "🖼 Отправьте фотографию вашей комнаты"
choose_room = "🖼 Выберите тип комнаты"
choose_style = "🖼 Выберите желаемый стиль интерьера"
gen_exit = "Чтобы выйти из диалога с нейросетью нажмите на кнопку ниже"
gen_error = "🚫 Ошибка генерации."
gen_ready = "✅ Готово"
img_watermark = "Создано при помощи @interior_ai_bot"
gen_wait = "⏳ Пожалуйста, подождите немного, пока нейросеть обрабатывает ваш запрос..."
channel_subscribe = "♻ Чтобы получить 5 кредитов подпишитесь на канал:" \
                    "\n\nhttps://t.me/pravoslavie_otkritki"
subscribe_success = "✅ Вы подписались на канал!" \
                    "\n+5 кредитов."
subscribe_sorry = "😥 К сожалению, вы больше не можете получить бесплатных кредитов."
buy_sub = "✅ Чтобы получить неограниченное число кредитов, оформите подписку." \
                  "\n\nСтоимость подписки 321 ₽"
err = "🚫 К сожалению произошла ошибка, попробуйте позже"